const mariadb = require('mariadb'); // ดึงคลังคำสั่งสำเร็จรูปเข้ามา เพื่อให้โปรแกรมคุยกับ MariaDB เป็น
const pool = mariadb.createPool({ // สร้างอ่างเก็บสายเชื่อมต่อฐานข้อมูล แล้วตั้งชื่อตัวแปรว่า pool
    host: 'localhost',            // กำหนดว่าฐานข้อมูลตั้งอยู่ที่เครื่องคอมพิวเตอร์ปัจจุบันของน้าเอง
    user: 'root',                 // ใส่ชื่อผู้ดูแลระบบหลักในการเข้าฐานข้อมูล คือสิทธิ์ 'root'
    password: '1234',             // ใส่รหัสผ่านเข้าฐานข้อมูลที่คุณน้าตั้งไว้คือ '1234'
    port: 3307,                   // ระบุช่องประตูทางเข้าของ MariaDB ในเครื่องน้า คือเลข 3307
    database: 'my_fitness',       // ระบุชื่อก้อนฐานข้อมูลที่จะวิ่งเข้าไปใช้งาน คือ 'my_fitness'
    connectionLimit: 5            // สั่งให้เปิดประตูสแตนด์บายรอสายไว้พร้อมกันสูงสุด 5 สาย
});

module.exports = pool;            // ส่งออกตัวแปร pool ให้ไฟล์อื่น (เช่น server.js) หยิบไปใช้วิ่งรัน SQL ได้ทันที
//ไฟล์นี้เหมือนเราทำ "ปลั๊กพ่วงสายตรง" ที่เสียบค้างไว้กับฐานข้อมูล my_fitness ด้วยรหัส 1234 เตรียมเอาไว้ 5 ช่องเสียบ (connectionLimit: 5) 
// พอไฟล์อื่น ๆ อยากจะดึงข้อมูลกิจกรรมมาโชว์หน้าบ้าน ก็แค่เอาปลั๊กของตัวเองมาเสียบต่อกับตัวแปร pool นี้ได้เลยทันที โดยไม่ต้องมานั่งพิมพ์รหัสผ่านใหม่ทุกครั้ง