var jwt = require('jsonwebtoken'); // ดึงคลังคำสั่งสำเร็จรูปเข้ามา เพื่อให้ระบบสามารถสร้างและตรวจรหัสตั๋ว JWT เป็น
var secretkey = "MySecretKey";     // ตั้งรหัสลับของระบบเรา (ห้ามคนอื่นรู้) เอาไว้ใช้ปั๊มตราและแกะรหัสล็อกอิน

module.exports = {                 // สั่งส่งออกกลุ่มฟังก์ชันพวกนี้ไปนอกไฟล์ เพื่อให้ไฟล์อื่นดึงไปใช้งานได้

  sign(payload) {                  // ฟังก์ชันสร้างตั๋ว (Sign) โดยรับข้อมูลผู้ใช้ (payload) เข้ามาปั๊มตราล็อกอิน
    let token = jwt.sign(payload, secretkey, { // สั่งให้คลัง JWT ทำการมัดรวมข้อมูลผู้ใช้ เข้ากับรหัสลับของเรา
      expiresIn: '1d'              // กำหนดให้ตั๋วใบนี้มีอายุการใช้งานแค่ 1 วัน (ถ้าเกิน 1 วัน ตั๋วจะหมดอายุทันที)
    });
    return token;                  // ส่งก้อนรหัสตั๋วสุดปลอดภัย (ที่ขึ้นต้นด้วย eyJhbGci...) กลับออกไปใช้งาน
  }, 

  verify(token) {                  // ฟังก์ชันตรวจตั๋ว (Verify) เอาไว้เช็กว่าตั๋วที่หน้าบ้านส่งมาเป็นของจริงไหม
    return new Promise((resolve, reject) => { // สร้างระบบสัญญาใจ (Promise) เพื่อรองรับการทำงานรอกลไกตรวจสอบ
      jwt.verify(token, secretkey, (err, decoded) => { // สั่งให้คลัง JWT ถอดรหัสตั๋วใบนี้ด้วยรหัสลับของเรา
        if (err) {                 // ถ้าตรวจแล้วเจอข้อผิดพลาด (เช่น ตั๋วปลอม หรือ ตั๋วหมดอายุ)
          reject(err);             // สั่งตอบปฏิเสธกลับไปทันทีว่า "ตั๋วใบนี้ใช้ไม่ได้!"
        } else {                   // แต่ถ้าตรวจสอบแล้วผ่านฉลุย เป็นตั๋วแท้แน่นอน
          resolve(decoded);        // สั่งตอบอนุมัติพร้อมส่งข้อมูลผู้ใช้ที่แกะกล่องออกมาแล้วกลับไปทำงานต่อ
        } 
      });
    });
  }
};
//ไฟล์นี้ทำหน้าที่เหมือน "เจ้าหน้าที่ออกตั๋วและตรวจตั๋วประจำสถานี" ค่ะ
//ฟังก์ชัน sign มีหน้าที่ตอนล็อกอิน คือเอาข้อมูลคนใช้มาแปะกาวรวมกับรหัสลับ MySecretKey แล้วเสกออกมาเป็นตั๋วรหัสยาว ๆ ให้หน้าบ้านพกติดตัวไว้ 1 วัน
//ฟังก์ชัน verify มีหน้าที่ตอนที่หน้าบ้านจะมาขอเข้าดูข้อมูลกิจกรรม มันจะเอาตั๋วใบนั้นมาให้ฟังก์ชันนี้ส่องกล้องขยายดู ถ้ารหัสลับตรงกัน ไม่หมดอายุ ก็จะอนุญาตให้ดึงข้อมูลกิจกรรมไปโชว์ในแอป