const pool = require('../libs/db_pool'); // ดึงไฟล์อ่างเก็บสายเชื่อมต่อฐานข้อมูลที่เราตั้งค่าไว้เข้ามาใช้งานในไฟล์นี้

module.exports = { // สั่งส่งออกกลุ่มฟังก์ชันภายในก้อนนี้ เพื่อให้ไฟล์อื่น (เช่น controller หรือ server.js) ดึงไปใช้งานได้
    getAllExercises: async () => { // สร้างฟังก์ชันดึงท่าออกกำลังกายทั้งหมด โดยรอบนี้ไม่ต้องรับค่าไอดีใด ๆ เข้ามา
        let conn; // เตรียมสร้างกล่องเปล่าชื่อ conn เอาไว้สำหรับรอใส่สายเชื่อมต่อฐานข้อมูล
        let result; // เตรียมสร้างกล่องเปล่าชื่อ result เอาไว้สำหรับรอเก็บก้อนผลลัพธ์ที่จะส่งกลับไปหน้าบ้าน

        try { // เริ่มต้นบล็อก try (แปลว่า "ลองทำตามคำสั่งในนี้ดูนะ") ถ้าทำงานราบรื่นดีจะทำจนเสร็จสิ้น
            conn = await pool.getConnection(); // สั่งให้ไปหยิบสายเชื่อมต่อฐานข้อมูลที่ว่างอยู่จากอ่าง pool มาเก็บไว้ใน conn

            var sql = "SELECT * FROM exercise"; // เขียนคำสั่ง SQL: สั่งเลือกดึงข้อมูลทุกคอลัมน์ ( * ) มาจากตารางที่ชื่อ exercise
            var rows = await conn.query(sql); // สั่งรันคำสั่ง SQL ด้านบน เพื่อกวาดเอารายการท่าออกกำลังกายทั้งหมดมาเก็บไว้ใน rows

            result = { // มัดก้อนผลลัพธ์ใส่กล่อง result เมื่อรันคำสั่งดึงข้อมูลท่าออกกำลังกายได้สำเร็จเรียบร้อย
                isError: false, // บอกหน้าบ้านว่า "ทำงานผ่านฉลุย ไม่พบข้อผิดพลาดจ้า"
                data: rows, // แนบก้อนข้อมูลรายการท่าออกกำลังกายทั้งหมดจากฐานข้อมูลส่งไปให้หน้าบ้าน
                errorMessage: "" // ช่องข้อความแจ้งเตือนข้อผิดพลาดปล่อยให้ว่างไว้ เพราะทำงานสำเร็จ
            };

        } catch (error) { // บล็อก catch จะทำงานทันทีถ้าเกิดระบบพัง หรือชื่อตารางสะกดผิดในบล็อก try
            result = { // มัดก้อนผลลัพธ์รูปแบบแจ้งเตือนความผิดพลาดใส่กล่อง result แทน
                isError: true, // บอกหน้าบ้านชัดเจนเลยว่า "เกิดข้อผิดพลาดขึ้นในการดึงข้อมูลนะ"
                data: "", // ข้อมูลส่งกลับปล่อยเป็นค่าว่างไว้ เพราะดึงข้อมูลมาไม่ได้
                errorMessage: error.message // ส่งข้อความสาเหตุที่ระบบพังไปให้หน้าบ้านเปิดอ่านดู
            };
        } finally { // บล็อกสุดท้ายจะทำงานเสมอ 100% ไม่ว่าระบบจะรันผ่านหรือรันพังก็ตาม
            if (conn) // เช็กดูว่าถ้าในกล่อง conn มีสายเชื่อมต่อค้างอยู่จริง ๆ
                conn.release(); // สั่งคืนสายเชื่อมต่อกลับเข้าอ่าง pool ทันที เพื่อไม่ให้เซิร์ฟเวอร์ค้างและกินแรม
        }

        return result; // ส่งก้อนผลลัพธ์สุดท้าย (ไม่ว่าจะสำเร็จหรือพัง) ในกล่อง result กลับคืนไปให้คนที่เรียกใช้ฟังก์ชันนี้
    }
};

//ฟังก์ชันนี้มีหลักการทำงานที่ง่ายมากค่ะอาจารย์ คือทำหน้าที่เป็น 
// "คนไปกวาดใบเมนูท่าออกกำลังกาย" โดยการเปิดประตูเชื่อมต่อเข้าไปแล้วสั่ง SELECT * FROM exercise 
// เพื่อเอาท์พุตรายการท่าออกกำลังกายทั้งหมดที่มีในระบบ (เช่น ท่าวิ่ง ท่าวิดพื้น ท่าปั่นจักรยาน)
//  ส่งไปกองให้หน้าบ้าน (Flutter) นำไปแสดงผลในกล่องตัวเลือก (Dropdown)
//  ให้ผู้ใช้งานสามารถกดเลือกเลือกท่าตอนจะบันทึกกิจกรรมได้